artillery/castor-1.yml
config:
  target: "http://stage-castor-app.azurewebsites.net"
  phases:
  - name: "short-burst"
    duration: 1
    arrivalRate: 1
scenarios:
  - name: "find-owners"
    flow:
    # - think: {{ $randomNumber(1,5) }}
    - get:
        url: "/owners.html"
        qs:
          lastName: "{{ $randomString(1) }}"